# BuiltInFailures.FabricSheetFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FabricSheetFailures Class
BuiltInFailures Class Members See Also
---
Failures related to fabric sheet elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class FabricSheetFailures
```

Visual Basic
---
```text
Public NotInheritable Class FabricSheetFailures
```

Visual C++
---
```text
public ref class FabricSheetFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..FabricSheetFailures
# See Also
BuiltInFailures..::..FabricSheetFailures Members
Autodesk.Revit.DB Namespace